# Data Analysis With Python Pandas exercise

# MS

In [62]:
import pandas as pd

In [63]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
data =pd.DataFrame(dict1)
data

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

#### Display top 3 rows of the data set

In [64]:
data.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

#### Check last 3 rows of the Dataset

In [65]:
data.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

#### Find shape of the dataset

In [66]:
data.shape

(7, 3)

In [67]:
print('Numbers of rows', data.shape[0])
print('Numbers of columns', data.shape[1])

Numbers of rows 7
Numbers of columns 3

#### Get information about the data set

In [68]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

#### Check null values in the dataset

In [69]:
data.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

#### get overall statistics about the dataframe

In [70]:
data.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [71]:
data.describe(include = 'all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Krisha        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

#### Find uniques values from gender column

In [72]:
data.Gender.unique() #or data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

#### Find the number of uniques values from  the gender column

In [73]:
data['Gender'].nunique()

2

#### Display count of unique values in gender column

In [74]:
data['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

#### ***Find the total number of students having marks between 90 to 100 (closed interval) using (&) and between method

In [75]:
len(data[(data['Marks']>=90) & (data['Marks']<=100)])

4

In [76]:
data['Marks'].between(90, 100).reset_index()

   index  Marks
0      0   True
1      1  False
2      2   True
3      3  False
4      4   True
5      5  False
6      6   True

In [77]:
sum(data['Marks'].between(90, 100))

4

#### Find averages marks

In [78]:
data.mean()

Marks    92.142857
dtype: float64

#### Apply methods

In [79]:
def marks(x):
    return x/2

In [80]:
data['half_Marks'] = data['Marks'].apply(marks)
data

      Name  Marks  Gender  half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [81]:
data['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

#### Map function

In [82]:
data

      Name  Marks  Gender  half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [83]:
data['Male_Female'] = data['Gender'].map({'Male':1, 'Female':0})
data

      Name  Marks  Gender  half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

#### Drop the columns

In [84]:
data

      Name  Marks  Gender  half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [85]:
data =data.drop('Male_Female', axis = 1)
data

      Name  Marks  Gender  half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

#### Print the name of the columns

In [89]:
data.columns

Index(['Name', 'Marks', 'Gender', 'half_Marks'], dtype='object')

#### Sort the Dataframe as per the marks column

In [87]:
data

      Name  Marks  Gender  half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [88]:
data.sort_values(by = 'Marks', ascending = False)

      Name  Marks  Gender  half_Marks
2   Krisha     99  Female        49.5
6  Archana     99  Female        49.5
0  Priyang     98    Male        49.0
4   Parshv     90    Male        45.0
1   Aadhya     89  Female        44.5
3   Vedant     87    Male        43.5
5   Mittal     83  Female        41.5

In [90]:
data['Gender']=='Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool